{"reviewerID": "ASY55RVNIL0UD", "asin": "120401325X", "reviewText": "These stickers work like the review says they do. They stick on great and they stay on the phone. They are super stylish and I can share them with my sister. :)", "overall": 5.0, "summary": "Really great product.", "unixReviewTime": 1389657600, "reviewTime": "01 14, 2014"}
{"reviewerID": "A2TMXE2AFO7ONB", "asin": "120401325X", "reviewText": "These are awesome and make my phone look so stylish! I have only used one so far and have had it on for almost a year! CAN YOU BELIEVE THAT! ONE YEAR!! Great quality!", "overall": 5.0, "summary": "LOVE LOVE LOVE", "unixReviewTime": 1403740800, "reviewTime": "06 26, 2014"}
{"reviewerID": "AWJ0WZQYMYFQ4", "asin": "120401325X", "reviewText": "Item arrived in great time and was in perfect condition. However, I ordered these buttons because they were a great deal and included a FREE screen protector. I never received one. Though its not a big deal, it would've been nice to get it since they claim it comes with one.", "overall": 4.0, "summary": "Cute!", "unixReviewTime": 1382313600, "reviewTime": "10 21, 2013"}
{"reviewerID": "ATX7CZYFXI1KW", "asin": "120401325X", "reviewText": "awesome! stays on, and looks great. can be used on multiple apple products.  especially having nails, it helps to have an elevated key.", "overall": 5.0, "summary": "leopard home button sticker for iphone 4s", "unixReviewTime": 1359849600, "reviewTime": "02 3, 2013"}
{"reviewerID": "APX47D16JOP7H", "asin": "120401325X", "reviewText": "These make using the home button easy. My daughter and I both like them.  I would purchase them again. Well worth the price.", "overall": 3.0, "summary": "Cute", "unixReviewTime": 1381536000, "reviewTime": "10 12, 2013"}
{"reviewerID": "A1JVVYYO7G56DS", "asin": "120401325X", "reviewText": "Came just as described.. It doesn't come unstuck and its cute! People ask where I got them from & it's great when driving.", "overall": 5.0, "summary": "best thing ever..", "unixReviewTime": 1377129600, "reviewTime": "08 22, 2013"}
{"reviewerID": "A6FGO4TBZ3QFZ", "asin": "3998899561", "reviewText": "it worked for the first week then it only charge my phone to 20%. it is a waste of money.", "overall": 1.0, "summary": "not a good Idea", "unixReviewTime": 1384992000, "reviewTime": "11 21, 2013"}
{"reviewerID": "A2JWEDW5FSVB0F", "asin": "3998899561", "reviewText": "Good case, solid build. Protects phone all around with good access to buttons. Battery charges with full battery lasts me a full day. I usually leave my house around 7am and return at 10pm. I'm glad that it lasts from start to end. 5/5", "overall": 5.0, "summary": "Solid Case", "unixReviewTime": 1380067200, "reviewTime": "09 25, 2013"}
{"reviewerID": "A8AJS1DW7L3JJ", "asin": "3998899561", "reviewText": "This is a fantastic case. Very stylish and protects my phone. Easy access to all buttons and features, without any loss of phone reception. But most importantly, it double power, just as promised. Great buy", "overall": 5.0, "summary": "Perfect Case", "unixReviewTime": 1396483200, "reviewTime": "04 3, 2014"}
{"reviewerID": "A2YO4SCWAWNYBI", "asin": "3998899561", "reviewText": "this case fits perfectly on the s4 and keeps me powerd all day I can't complain! a+ recommend it to all", "overall": 5.0, "summary": "Just what I needed", "unixReviewTime": 1397347200, "reviewTime": "04 13, 2014"}
{"reviewerID": "A3AFELPYTZH90T", "asin": "3998899561", "reviewText": "This is the first battery case I have had for my Galaxy S4. The S4 fits very well, is slim and doesn't add much weight to the Galaxy S4. It doubles the battery life. You can charge either the battery, the phone or both. There is a handy on-off switch with leds to indicate the level of charge.The battery case came on time and was packaged well. Well worth the price.", "overall": 5.0, "summary": "A Winner", "unixReviewTime": 1384905600, "reviewTime": "11 20, 2013"}
{"reviewerID": "A6Q0P54QSP11J", "asin": "3998899561", "reviewText": "Performs exactly as advertised . It's very  sturdily built,and provides lots of boost . It does exactly what it's supposed too .Easy to insert phone in and out . Definitely a 5 star experience. Don't know what I would do without this case LOVE LOVE LOVE it.", "overall": 5.0, "summary": "Absolutely love the case !!", "unixReviewTime": 1386201600, "reviewTime": "12 5, 2013"}
{"reviewerID": "ANMATY0L0HX6Y", "asin": "3998899561", "reviewText": "Unlike Most of the Rechargeable Battery cases, PowerBear Lasts up to 2 whole days. It doesn't heat up like most of the other ones, and I was completely fascinated by the ultra light and sleek design for the case. Before I was using the Mophie case but I couldn't wear it often because it was like having a hot brick in your pocket, Hence I had to always leave it at home.On the contrary, with PowerBear, I never take it off because I can't even tell the difference. Also it is build in a super STRONG manner and even though I dropped my phone a few times, its shock resistant technology won't let a single thing happen to the case or the phone. The PowerBear case became an extension to my phone that I never have to take off because when I charge it at night, it charges both my phone and the case, and I have battery life for more than two days. I was also shocked to hear all the positive compliments I was hearing from people at my job, fitness center, and throughout the community. Everybody was loving the case, and what they don't know is that it cost  me 60 % CHEAPER then all the other brand. This is the best purchase I've made on the internet, and I am going to buy more for my family in time for the Holidays. THANK YOU POWERBEAR!!!!!!!!!!!!!!", "overall": 5.0, "summary": "Best Rechargeable Battery Case on the Market!!!!!!!!!! A++++++++", "unixReviewTime": 1380240000, "reviewTime": "09 27, 2013"}
{"reviewerID": "A1XBPVR8FE7TE1", "asin": "3998899561", "reviewText": "Just what I needed. I needed a phone case for myself and my two sons, but I also needed new replacement batteries. Now this isn't the case, since I got both in one. Awesome thanks A+", "overall": 5.0, "summary": "Exactly what I needed", "unixReviewTime": 1392940800, "reviewTime": "02 21, 2014"}
{"reviewerID": "A35C4777EXZZQH", "asin": "3998899561", "reviewText": "When there is no outlets, or chargers near by its Powerbear to the rescue! Ordered one for my husband, and myself. Great purchase!!", "overall": 5.0, "summary": "5 star phone case", "unixReviewTime": 1397779200, "reviewTime": "04 18, 2014"}
{"reviewerID": "ACU3LCRX4A8RV", "asin": "3998899561", "reviewText": "It works great. Doesn't heat up like crazy like the other ones I got, and cheaper too! Its definetly the best power case for the S4 you can get, thats why I got one for me and my wife. I wonder why its called power bear..", "overall": 5.0, "summary": "SUPER DUPER QUALITY!", "unixReviewTime": 1377388800, "reviewTime": "08 25, 2013"}
{"reviewerID": "A1ZTTNS6SWFV52", "asin": "6073894996", "reviewText": "Surprisingly, this inexpensive version works just as well and just as reliably as the expensive variety. It has been working for me for months now. No problem. Excellent value.", "overall": 5.0, "summary": "Top Quality. Works like the Expensive Version", "unixReviewTime": 1368230400, "reviewTime": "05 11, 2013"}
{"reviewerID": "A38EHCCO532RYI", "asin": "6073894996", "reviewText": "I have tested this against the griffin dual output unit.I checked the charging current.This unit was charging my galaxy note battery with 70 ma.Griffin was charging with 40 ma! And the griffin was 4 times more expensive.I have not used these for very long. I bought 15 of them, because they are so cheap and because they actually do seem to provide high current.No idea how long they last. I assume they will work fine. I have not been using them much. I did the testing , just to stock up on a high current charger. This passed and I stocked up.", "overall": 5.0, "summary": "High power as promised!", "unixReviewTime": 1348012800, "reviewTime": "09 19, 2012"}
{"reviewerID": "A2INSXDTE08WSJ", "asin": "6073894996", "reviewText": "It worked great for the first couple of weeks then it just stopped completely.. so basically a small waste of money.", "overall": 1.0, "summary": "Horrible", "unixReviewTime": 1369785600, "reviewTime": "05 29, 2013"}
{"reviewerID": "A9NETBZNEW2TP", "asin": "6073894996", "reviewText": "I love that it has two ports for my phone and ipod. Who wants to be putting too many things in one socket.  Sleek and convenient to store and I just love it.", "overall": 5.0, "summary": "USB Port", "unixReviewTime": 1402012800, "reviewTime": "06 6, 2014"}
{"reviewerID": "A385HZRPXDDFCL", "asin": "6073894996", "reviewText": "just what you need, I am always having to charge my phone and then find I have another item to charge also.", "overall": 5.0, "summary": "Works great", "unixReviewTime": 1385683200, "reviewTime": "11 29, 2013"}
{"reviewerID": "ALZQ9D8V53TI2", "asin": "6073894996", "reviewText": "does not have the need amps to charge things like ipads, or hp touchpads. but its super small and compact.", "overall": 3.0, "summary": "it works", "unixReviewTime": 1368835200, "reviewTime": "05 18, 2013"}
{"reviewerID": "A3VWU7S29LR2XX", "asin": "6073894996", "reviewText": "They are nothing special for sure, but it's nice that you can tell when it is powered up by the led that glows in it.  able to charge two phones at once in the car which is nice.", "overall": 4.0, "summary": "I like the fact they light up.", "unixReviewTime": 1402185600, "reviewTime": "06 8, 2014"}
{"reviewerID": "A3TOHPW7ES23NZ", "asin": "6073894996", "reviewText": "I have several chargers. Have more than one vehicle so I keep more than one of these in each. Nothing more frustrating than finding all of a sudden one quits working, and you have no way to recharge your phone. That is always when you need it most.  This one works well for any of my products.", "overall": 4.0, "summary": "Works great", "unixReviewTime": 1389398400, "reviewTime": "01 11, 2014"}
{"reviewerID": "A1LGWLFF0YD0KV", "asin": "6073894996", "reviewText": "I bought this a little skeptical. After I tried it I bought two more. It works great and so far it has lasted for about 3 months. If that changes I will update this review.", "overall": 5.0, "summary": "Works great", "unixReviewTime": 1379721600, "reviewTime": "09 21, 2013"}
{"reviewerID": "A2YODGM5RUZ7I1", "asin": "6073894996", "reviewText": "I am disappointed that the 1A didn't work with my iPad.  That's what I get for buying a cheap adapter.", "overall": 2.0, "summary": "This doesn't work with my iPad.", "unixReviewTime": 1403481600, "reviewTime": "06 23, 2014"}
{"reviewerID": "A29OXVQRZ154KX", "asin": "6073894996", "reviewText": "This is a nice charger but you can tell it was made cheaply in China.  When it is charging the phone, the car radio gets LOTS of static.  Not so much that I have to stop charging but like when you are near power lines and the radio station is far away.So, no RF shielding.I gave it 4 stars because it works fine for me, but if you listen to the radio, you might consider it is more like 2 or 3 stars.", "overall": 4.0, "summary": "Solid Charger but RF noisy", "unixReviewTime": 1363737600, "reviewTime": "03 20, 2013"}
{"reviewerID": "A2U5NF3IH4YVKH", "asin": "6073894996", "reviewText": "After a week only one side works", "overall": 2.0, "summary": "Two Stars", "unixReviewTime": 1404345600, "reviewTime": "07 3, 2014"}
{"reviewerID": "A34XJA5OE33FP1", "asin": "6073894996", "reviewText": "Yo get exactly what you order in a timely fashion. And the item is just as described. Great buy if you ask me", "overall": 4.0, "summary": "Ok", "unixReviewTime": 1360195200, "reviewTime": "02 7, 2013"}
{"reviewerID": "A2DZO8MWVM4WKD", "asin": "6073894996", "reviewText": "This is a terribly awesome product in my Subaru's console.  Passengers love it, I love it because it emits a blue glow, because it has held up to abuse over the years and performs like new.", "overall": 5.0, "summary": "USB slots in a blue light that never quits", "unixReviewTime": 1384041600, "reviewTime": "11 10, 2013"}
{"reviewerID": "A3VCIEAN3NYO12", "asin": "6073894996", "reviewText": "I've bough a munch of different things like this over the years. Most wouldn't stay in the jack, or would give out after a few days. This one is GREAT!", "overall": 5.0, "summary": "good", "unixReviewTime": 1365292800, "reviewTime": "04 7, 2013"}
{"reviewerID": "ASRM2FSLDPXVX", "asin": "6073894996", "reviewText": "Only works one side at a time. When you connect two cables, one side stop working and also overheated burning the fuses. I purchased two of them and it's the same problem. Cheap and bad quality.", "overall": 1.0, "summary": "don't waste your money, pay more and buy one at Walgreen s.", "unixReviewTime": 1398729600, "reviewTime": "04 29, 2014"}
{"reviewerID": "A31XHOCG62WJH4", "asin": "6073894996", "reviewText": "it works great i like i can charge two thing at the same now i dont have to wait for my to finish charging her phone", "overall": 5.0, "summary": "charger", "unixReviewTime": 1381795200, "reviewTime": "10 15, 2013"}
{"reviewerID": "A2I7NEVKSJ5UWR", "asin": "6073894996", "reviewText": "It came at last, good looking and the price was good and i believe it is worth the time I waited for it to come to me good job", "overall": 4.0, "summary": "good job", "unixReviewTime": 1395878400, "reviewTime": "03 27, 2014"}
{"reviewerID": "A30A04FS5YAES3", "asin": "6073894996", "reviewText": "Didn't last very long. Worked great when it worked but it is a cheap piece of plastic crap so I shouldn't have expected it to last.", "overall": 2.0, "summary": "Works for a while.", "unixReviewTime": 1377216000, "reviewTime": "08 23, 2013"}
{"reviewerID": "A2Y937AV46ULWQ", "asin": "6073894996", "reviewText": "excellent product, works great , have easy handling, and good quality as it is announced. reached as is shown time and in very good condition thank you very much for everything", "overall": 4.0, "summary": "good", "unixReviewTime": 1397347200, "reviewTime": "04 13, 2014"}
{"reviewerID": "A2KP65JS3YY5VL", "asin": "6073894996", "reviewText": "Purchased two and we put one in each car. Now we charge our ipad and iohone together. Can also use to power my Galaxy Note 2 or recharge other USB devices. If you have to think about it you need counseling", "overall": 5.0, "summary": "Works great. Very inexpensive", "unixReviewTime": 1358035200, "reviewTime": "01 13, 2013"}
{"reviewerID": "A2L6BH090TX9O7", "asin": "6073894996", "reviewText": "great charger for 2 devices and i haven't had any problems so far 3yrs now", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1375401600, "reviewTime": "08 2, 2013"}
{"reviewerID": "ABDDX2PV61RMX", "asin": "6073894996", "reviewText": "Purchased product about many a month ago. Pros: Loved it work just fine!! Cool Blue light feature when you plug it into the lighter!! Can plug in two things at one time....Con: Top clear piece came off easily overtime (I just put clear tape around the top) TOTAL: PROS:95% CONS:5%", "overall": 4.0, "summary": "Dual USB Port Car Charger", "unixReviewTime": 1354147200, "reviewTime": "11 29, 2012"}
{"reviewerID": "A9VL5ER8D0K2Z", "asin": "6073894996", "reviewText": "I bought this so that I could use and charge my Tab at the same time. My tab does not recognize the high power port and will either charge while off or use power while on, it will not charge while powered on.", "overall": 2.0, "summary": "not high power", "unixReviewTime": 1336176000, "reviewTime": "05 5, 2012"}
{"reviewerID": "A2NTV6MHFXP4M", "asin": "6073894996", "reviewText": "I bought this to charge my iphone and tablet in the car. works for iphone but not the tablet. I needed a stronger charge for that but this is still great for both iphoe and ipod together. it's cheap, small and compact", "overall": 5.0, "summary": "works", "unixReviewTime": 1360281600, "reviewTime": "02 8, 2013"}
{"reviewerID": "A10W7D1W5M4CHE", "asin": "6073894996", "reviewText": "Works great. The blue led light is a nice touch in the car. We charge a Samsung and Iphone using this outlet. Nice low profile too.", "overall": 5.0, "summary": "USB Outlet", "unixReviewTime": 1359676800, "reviewTime": "02 1, 2013"}
{"reviewerID": "A2B8HBZPIFYRV1", "asin": "6073894996", "reviewText": "works great and charges ipads, tablets, smartphones as well as bluetooth speakers and headsets. I would recommend it to anyone looking for a universal car charger.", "overall": 4.0, "summary": "Good little charger", "unixReviewTime": 1390694400, "reviewTime": "01 26, 2014"}
{"reviewerID": "A5A4374R8I7NB", "asin": "6073894996", "reviewText": "I could only give this USB car charger 2 stars because although it worked fine for about 3 months, it subsequently died on me.Pros:-Has 2 USB ports for charging, one (the top) is 2.1 amps.  The bottom slot is lower, presumably 1 or 1.5 amps.-Fits well in my charging socket - holds tight.  I've had some that were loose in my charging socket.-Works well to charge my iPhone in the top slot and the bottom slot works with most Android phones, except the very high end ones.-Has a blue LED light to tell you it is on and ready to charge.-The USB sockets seem to be well made and tightly fit all my cables.-Pretty solid construction.-It cost less than $2.Cons:-It died on me after 3 months.I had really enjoyed using this USB charger.  It rapidly charged my iPhone and worked well with charging the phones of my family and friends.  The two slot design makes this design very handy; with a 1 slot design, no one else can charge their device unless I remove my cord.  Of course, after this charger died, I had to go back to the 1 slot design I was using before.After 3 months, I began to notice the LED light flickering.  It was less than a week later that is quit working permanently.  I'm not sure what the problem was - faulty wiring, bad design, I guess I'll never know.  I thought about getting another since they are so cheap, but then I thought better of it.  Maybe they are so cheap because they are simply disposable after a short period of time.For whatever reason, it died and I was forced to look for another 2 slot design - I haven't found one in my price range yet.", "overall": 2.0, "summary": "Works Fine, But It Died On ME", "unixReviewTime": 1340582400, "reviewTime": "06 25, 2012"}
{"reviewerID": "A1OWZHEQ5UCSAN", "asin": "6073894996", "reviewText": "This charger works great and is short, unlike most chargers. It does a great job with charging both my phone and my GPS when I am in the car.  Great value and easy on the wallet.", "overall": 5.0, "summary": "Great Dual Charger", "unixReviewTime": 1360195200, "reviewTime": "02 7, 2013"}
{"reviewerID": "A25TQLMIAPI1T6", "asin": "6073894996", "reviewText": "I bought 2 of this and tried to test first ... after few minutes of charging, it felt hot. Pulled it out and the product smelled burnt. Tried the other one too and same thing. Be careful... this one could be fire hazard or could potentially destroy the electrical system", "overall": 1.0, "summary": "Be careful", "unixReviewTime": 1403395200, "reviewTime": "06 22, 2014"}
{"reviewerID": "A382RYVVZOJ8PX", "asin": "6073894996", "reviewText": "This portable USB Port car charger is a must have for people on the go.  Pair this with an extra or spare cord and you are good to go!", "overall": 5.0, "summary": "A must have for people on the go", "unixReviewTime": 1365120000, "reviewTime": "04 5, 2013"}
{"reviewerID": "A3GTTANAYUVSDY", "asin": "6073894996", "reviewText": "I love the way it can charge 2 devices at once!  Seems to charge quicker without GPS on, with it on, it only holds the battery, but better than it dying!!!", "overall": 4.0, "summary": "Works best without location/GPS on device", "unixReviewTime": 1400803200, "reviewTime": "05 23, 2014"}
{"reviewerID": "A16EFGT2PLZT34", "asin": "6073894996", "reviewText": "Bought so we could charge to phones at the same time while in the car from the same port.  Works.", "overall": 4.0, "summary": "Works", "unixReviewTime": 1378252800, "reviewTime": "09 4, 2013"}